app/views/boards/show.html.erb

SELECT `comments`.* FROM `comments` WHERE `comments`.`board_id` = 1
SELECT COUNT(*) FROM `comments` WHERE `comments`.`board_id` = 1
---
            <% count = 0 %>
            <% @board.comments.each do |comment| %>
                <!--count보다 더 많이 돌아가는 버그-->
                <% unless count >= @board.comments.count %>