app/controllers/boards_controller.rb

SELECT `boards`.* FROM `boards`
---
  def index
    @boards = Board.all

INSERT INTO `boards` (`title`, `content`, `boardimage`, `created_at`, `updated_at`) VALUES ('test2', 'test2', '#<ActionDispatch::Http::UploadedFile:0x00007f1dc09e5400>', '2018-11-01 12:32:31', '2018-11-01 12:32:31')
---
  def create
    @board = Board.new(board_params)

    respond_to do |format|
      if @board.save

SELECT  `boards`.* FROM `boards` WHERE `boards`.`id` = 1 LIMIT 1
---
    def set_board
      @board = Board.find(params[:id])