app/controllers/comments_controller.rb

INSERT INTO `comments` (`title`, `comment`, `commentable_type`, `commentable_id`, `created_at`, `updated_at`) VALUES ('이광빈', '입니다', 'Board', 1, '2018-11-01 12:09:25', '2018-11-01 12:09:25')
---
  def create
    @comment = @commentable.comments.new(comment_params)
    if @comment.save