app/controllers/posts_controller.rb

  def index
    @posts = Post.order("created_at DESC").paginate(:page => params[:page], :per_page => 6)
---
SELECT  `posts`.* FROM `posts` ORDER BY created_at DESC LIMIT 6 OFFSET 0
SELECT COUNT(*) FROM `posts`

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`title`, `content`, `image`, `created_at`, `updated_at`) VALUES ('재테스트', 'ㄱㄱ', '2018_9_18_여론조사_문제점_안철수_등.pdf', '2018-11-01 12:16:14', '2018-11-01 12:16:14')