app/controllers/board/comments_controller.rb

SELECT  `boards`.* FROM `boards` WHERE `boards`.`id` = 1 LIMIT 1
---
  def set_commentable
    @commentable = Board.find(params[:board_id])