app/controllers/post/comments_controller.rb

  def set_commentable
    @commentable = Post.find(params[:post_id])
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1